app/admin/admin_users.rb

SELECT "departments".* FROM "departments" WHERE "departments"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def scoped_collection
      if current_admin_user.staff?
        AdminUser.where(id: current_admin_user.id)
      else
        AdminUser.all
      end
    end
  end

  index do
    selectable_column
    id_column
    column :email
    column :role
    column :department_id do |obj|
      department = Department.find_by(id: obj.department_id)

SELECT "departments".* FROM "departments" WHERE "departments"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
      row :email
      row :role
      row :department_id do |obj|
        department = Department.find_by(id: obj.department_id)

SELECT "departments".* FROM "departments"
---
      f.input :email
      if current_admin_user.admin_user?
        f.input :role
        f.input :department, as: :select, collection: Department.all.map { |dept| [dept.department_name, dept.id] }