app/admin/attendences.rb

SELECT COUNT(*) FROM "attendences"
SELECT "admin_users".* FROM "admin_users" WHERE "admin_users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def calculate_total_attendance_count
      @total_attendance_count =
        if current_admin_user&.admin_user?
          Attendence.ransack(params[:q]).result.count
        elsif current_admin_user&.staff?
          Attendence.where(staff_id: current_admin_user.id).ransack(params[:q]).result.count
        else
          Attendence.count
        end
    end

    helper_method :calculate_total_attendance_count
  end

  index do
    calculate_total_attendance_count
    div class: 'total-attendance-count' do
      "<strong>Total Attendance Count:</strong> #{calculate_total_attendance_count}".html_safe
    end

    selectable_column
    id_column

    if current_admin_user.admin_user?
      column :staff_id do |staff|
        staff_email = AdminUser.find_by(id: staff.staff_id)

SELECT "admin_users"."email", "admin_users"."id" FROM "admin_users" WHERE "admin_users"."role" = ?  [["role", 1]]
---

  form do |f|
     f.inputs 'Attendences Details' do
      f.input :staff_id, as: :select, collection: AdminUser.where(role: :staff).pluck(:email, :id)

SELECT "admin_users".* FROM "admin_users"
---
    f.actions
  end

  filter :staff_id,as: :select,collection: proc { AdminUser.all.map { |user| [user.email, user.id] } }, if: proc { current_admin_user&.admin_user? }