app/admin/dashboard.rb

        div class: "left-section" do
          div class: "notice-board" do
            # Fetch the latest notice
            notice = NoticeBoard.last
---
SELECT "notice_boards".* FROM "notice_boards" ORDER BY "notice_boards"."id" DESC LIMIT ?  [["LIMIT", 1]]


    if current_admin_user.admin_user?
      panel "Recent Staff Check-ins" do
        table_for Attendence.order(check_in_time: :desc).limit(10) do
---
SELECT "attendences".* FROM "attendences" ORDER BY "attendences"."check_in_time" DESC LIMIT ?  [["LIMIT", 10]]