app/admin/leaves.rb

SELECT "admin_users".* FROM "admin_users"
---
    f.actions
  end

  filter :staff_id,as: :select,collection: proc { AdminUser.all.map { |user| [user.email, user.id] } }, if: proc { current_admin_user&.admin_user? }