app/admin/leaves.rb

  scope "Today" do |leaves|
    leaves.where("start_date = ?", Date.today)
  end

  index do
    selectable_column
    id_column

    if current_admin_user.admin_user?
      column :staff_id do |staff|
        staff_email = AdminUser.find_by(id: staff.staff_id)
---
SELECT "admin_users".* FROM "admin_users" WHERE "admin_users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]


  form do |f|
    staff = current_admin_user
    leave_types = LeaveType.all
---
SELECT "leave_types".* FROM "leave_types"

      div class: "leave-summary-container" do
        leave_types.each do |leave_type|
          total_allowed = leave_type.max_allowed || 0
          taken = Leave.where(staff_id: staff.id, leave_type_id: leave_type.id)
                       .where("start_date >= ?", Date.today.beginning_of_year)
                       .count
---
SELECT COUNT(*) FROM "leaves" WHERE "leaves"."staff_id" = ? AND "leaves"."leave_type_id" = ? AND (start_date >= '2025-01-01')  [["staff_id", 3], ["leave_type_id", 1]]

    end

    available_leave_types = leave_types.select do |leave_type|
      taken = Leave.where(staff_id: staff.id, leave_type_id: leave_type.id)
                   .where("start_date >= ?", Date.today.beginning_of_year)
                   .count
---
SELECT "leaves".* FROM "leaves" WHERE "leaves"."staff_id" = ? AND (start_date >= '2025-01-01')  [["staff_id", 3]]
SELECT COUNT(*) FROM "leaves" WHERE "leaves"."staff_id" = ? AND "leaves"."leave_type_id" = ? AND (start_date >= '2025-01-01')  [["staff_id", 3], ["leave_type_id", 1]]