app/admin/profile.rb

SELECT "departments".* FROM "departments" WHERE "departments"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
---
        def index
          redirect_to admin_profile_path(current_admin_user)
        end
    end

    show do
        attributes_table do
          if current_admin_user.staff?
            row :profile_image do |image|
              if image.profile_image.attached?
                div class: 'circular-profile-image' do
                  image_tag(image.profile_image, class: 'profile-image')
                end
              else
                content_tag(:span, 'No Image')
              end
            end
          end

          row :email
          row :role
          row :full_name
          row :address
          row :contact_number
          row :gender
          row :date_of_birth
          row :department_id do |obj|
              department = Department.find_by(id: obj.department_id)