app/admin/salaries.rb

SELECT "admin_users".* FROM "admin_users" WHERE "admin_users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def scoped_collection
      if current_admin_user.staff?
        Salary.where(staff_id: current_admin_user.id)
      else
        Salary.all
      end
    end
  end

  index do
    selectable_column
    id_column

    if current_admin_user.admin_user?
      column :staff_id do |staff|
        staff_email = AdminUser.find_by(id: staff.staff_id)

SELECT "admin_users"."email", "admin_users"."id" FROM "admin_users" WHERE "admin_users"."role" = ?  [["role", 1]]
---

  form do |f|
     f.inputs 'Salaries Details' do
      f.input :staff_id, as: :select, collection: AdminUser.where(role: :staff).pluck(:email, :id)

SELECT "admin_users".* FROM "admin_users"
---
    end
  end

  filter :staff_id,as: :select,collection: proc { AdminUser.all.map { |user| [user.email, user.id] } }, if: proc { current_admin_user&.admin_user? }