app/mailers/permission_mailer.rb

SELECT "admin_users"."email" FROM "admin_users" WHERE "admin_users"."role" = ?  [["role", 1]]
---
    def permission_notification(permission)
      @permission = permission
      emails = AdminUser.where(role: permission.role).pluck(:email)