app/controllers/holidays_controller.rb

SELECT "holidays".* FROM "holidays" WHERE "holidays"."date" BETWEEN ? AND ?  [["date", "2025-02-23"], ["date", "2025-04-06"]]
---
    def show_holidays
        start_date = params[:start].to_date
        end_date = params[:end].to_date

        events = Holiday.where(date: start_date..end_date).map do |holiday|