app/controllers/staffs_controller.rb

UPDATE "admin_users" SET "updated_at" = ?, "login_time" = ? WHERE "admin_users"."id" = ?  [["updated_at", "2025-03-31 06:58:17.319770"], ["login_time", "2025-03-31 06:58:17.319066"], ["id", 2]]
---
  def login
    if current_admin_user.login_time.nil?
      current_admin_user.update(login_time: Time.now)

UPDATE "admin_users" SET "updated_at" = ?, "logout_time" = ? WHERE "admin_users"."id" = ?  [["updated_at", "2025-04-01 12:04:07.263661"], ["logout_time", "2025-04-01 12:04:07.262487"], ["id", 3]]
---
  def logout
    if current_admin_user.login_time.present?
      current_admin_user.update(logout_time: Time.now)

INSERT INTO "attendences" ("staff_id", "date", "status", "created_at", "updated_at", "latitude", "longitude", "city", "country", "ip_address", "check_in_time") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def check_in
    ip_info = `curl http://ipinfo.io/json`.strip
    location_data = JSON.parse(ip_info)
    lat, long = location_data['loc'].split(',')
    latitude = lat
    longitude = long
    city = location_data['city']
    country = location_data['country']

    attendance = Attendence.create(
      staff_id: current_admin_user.id,
      date: Date.today,
      status: 'Present',
      latitude: latitude,
      longitude: longitude,
      city: city,
      country: country,
      ip_address: location_data['ip'],
      check_in_time: Time.current
    )

SELECT "attendences".* FROM "attendences" WHERE "attendences"."staff_id" = ? AND "attendences"."date" = ? LIMIT ?  [["staff_id", 3], ["date", "2025-04-01"], ["LIMIT", 1]]
INSERT INTO "attendences" ("staff_id", "date", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["staff_id", 3], ["date", "2025-04-01"], ["status", "Absent"], ["created_at", "2025-04-01 10:08:01.181504"], ["updated_at", "2025-04-01 10:08:01.181504"]]
UPDATE "attendences" SET "status" = ?, "updated_at" = ? WHERE "attendences"."id" = ?  [["status", "Absent"], ["updated_at", "2025-04-01 11:55:19.431749"], ["id", 14]]
---
  def calculate_attendance(user)
    # Check if login and logout times are present and on the same day
    if user.login_time.present? && user.logout_time.present? && user.login_time.to_date == user.logout_time.to_date
      # Calculate time difference in hours
      time_difference = (user.logout_time - user.login_time) / 1.hour

      # Check if time difference is greater than or equal to 8 hours
      if time_difference >= 8
        find_attendence = user.attendences.find_by(date: user.login_time.to_date)
        if find_attendence
          find_attendence.update(status: "Present")
        else
          Attendence.create(staff: user, status: "Present", date: user.login_time.to_date)
        end
      elsif time_difference >= 4
        find_attendence = user.attendences.find_by(date: user.login_time.to_date)
        if find_attendence
          find_attendence.update(status: "Half_day")
        else
          Attendence.create(staff: user, status: "Half_day", date: user.login_time.to_date)
        end
      else
        find_attendence = user.attendences.find_by(date: user.login_time.to_date)
        if find_attendence
          find_attendence.update(status: "Absent")