app/models/leave.rb

SELECT "leaves".* FROM "leaves" WHERE "leaves"."staff_id" = ? AND "leaves"."end_date" = ? LIMIT ?  [["staff_id", 2], ["end_date", "2025-04-01"], ["LIMIT", 1]]
SELECT "leaves".* FROM "leaves" WHERE "leaves"."staff_id" = ? AND "leaves"."end_date" = ? LIMIT ?  [["staff_id", 3], ["end_date", "2025-04-01"], ["LIMIT", 1]]
---
    def unique_month_leave_day
      return unless staff_id.present? && end_date.present?

      existing_leave = Leave.find_by(staff_id: staff_id, end_date: end_date)
      errors.add(:end_date, 'You have already applied for leave on this day in this month') if existing_leave.present?