app/models/salary.rb

SELECT "leaves".* FROM "leaves" WHERE "leaves"."staff_id" = ? AND (strftime('%m', start_date) = '03' AND strftime('%Y', start_date) = '2025' AND status = 2 AND leave_type = 'Loss Of Pay')  [["staff_id", 3]]
---
    def calculate_deducted_salary

        return { deducted_amount: 0, net_amount: 0 } unless staff.present? && date.present? && amount.present?

        leaves_in_month = staff.leaves.where(
            "strftime('%m', start_date) = ? AND strftime('%Y', start_date) = ? AND status = ? AND leave_type = ?",
            date.month.to_s.rjust(2, '0'), date.year.to_s, Leave.statuses[:approved], Leave.leave_types[:Loss_of_pay]
        )

        total_days_in_month = Time.days_in_month(date.month, date.year)
        sal_per_day = amount / total_days_in_month
        total_leave_days = leaves_in_month.sum { |leave| (leave.end_date - leave.start_date).to_i + 1 }

SELECT "salaries".* FROM "salaries" WHERE "salaries"."staff_id" = ? AND "salaries"."date" BETWEEN ? AND ? LIMIT ?  [["staff_id", 3], ["date", "2025-03-01"], ["date", "2025-03-31"], ["LIMIT", 1]]
---
    def unique_month_year_combination
        if date.present?
          existing_salary = Salary.find_by(staff_id: staff_id, date: date.beginning_of_month..date.end_of_month)